// import React from 'react';
const ua = {
  forWrapper: {
    content: {
      main: {
        header: 'Промисловий 3D-дизайн',
        description:
          "Створення 3D-моделі (або 3D-дизайн) - це процес розробки за допомогою комп'ютерної графіки комплексної цифрової тривимірної моделі майбутнього виробу. ",
      },
      img: {
        link: '/services/3D-modeling-process.jpeg',
        alt: "Монітор комп'ютера із зображенням 3D моделі дрона.",
      },
    },

    backgroundStyle: 1,
  },

  useCases: {
    header: 'У яких випадках 3D-модель буде корисною?',
    list: [
      'Друк прототипів на 3D-принтері.',
      'Візуалізація майбутнього виробу.',
      'Виготовлення деталей на фрезерних верстатах з ЧПУ.',
      'Виготовлення жорстких ливарних форм.',
    ],
  },
  stages: {
    header: 'Етапи створення 3D-моделі',
    // eslint-disable-next-line @typescript-eslint/prefer-as-const
    nestedListIcon: 'laptop' as 'laptop',
    nestedList: [
      {
        header: '1. Формування технічного завдання (ТЗ):',
        paragraphs: [
          'Визначення мети створення моделі (виробництво, візуалізація, симуляція), аналіз документації (креслення, ескізи, технічні характеристики), вибір матеріалів, визначення необхідного рівня деталізації та масштабування.',
        ],
      },
      {
        header: '2. Розробка концепції та попередня візуалізація',
        paragraphs: [
          'Створення ручних або цифрових ескізів, створення початкової концептуальної моделі з використанням базових форм, узгодження концепції з замовником.',
        ],
      },
      {
        header: '3. 3D-моделювання',
        paragraphs: [
          'Розробка базової геометрії моделі, додавання дрібних елементів (отвори, ребра, канавки), Створення текстур для візуалізації.',
        ],
      },
      {
        header: '4. Фінальна валідація',
        paragraphs: [
          'Погодження кінцевої моделі з замовником, надання всіх необхідних файлів і документації, планування подальшого виробництва.',
        ],
      },
      {
        header: '5. Адаптація моделі до обраного способу виробництва',
        paragraphs: [
          'Поділ моделі на сегменти для виробничих потреб, створення креслень, схем складання, специфікацій, експорт файлів у необхідному форматі для 3D-друку або ЧПК-обробки.',
        ],
      },
    ],
  },

  product: {
    header: 'Що ви отримуєте?',
    list: [
      'Готову 3D-модель в STL форматі.',
      'Можливість виготовлення прототипу виробу, на базі створеної цифрової моделі.',
    ],
  },
};
export const textModeling3D = {
  ua,
};
