import React from 'react';

const ua = {
  mainHeader: 'Поширені запитання',
  questionCards: [
    {
      question: 'Яка вартість ваших виробів?',
      text: [
        'У нас немає універсальної ціни на всі вироби. Розрахунок ціни для дрібносерійного лиття пластмас у вакуумі залежить від кількох основних факторів: ',
        <>
          <strong>Вартість виготовлення майстер-моделі.</strong> Якщо
          майстер-модель створюється спеціально для вашого проєкту (наприклад,
          3D-друком або ручною обробкою), її виготовлення додає значну частку до
          загальної вартості, особливо для малих партій.
        </>,
        <>
          <strong>Ціна форми для лиття.</strong> Вартість залежить від розміру,
          складності деталі та якості силікону або поліуретану. Форми мають
          обмежений термін служби (зазвичай 20–50 виливок), тому на більші
          партії може знадобитися кілька форм.
        </>,
        <>
          <strong>Матеріали для лиття.</strong> Тип пластику (прозорий, гнучкий,
          термостійкий чи ударостійкий пластик має різну ціну). Кількість
          потрібного матеріалу також має значення.
        </>,
        <>
          <strong>Кількість виробів.</strong> Ціна за одну деталь зменшується зі
          зростанням тиражу, оскільки витрати на форму та підготовку
          розподіляються на більшу кількість виробів.
        </>,
        <>
          <strong>Складність деталей.</strong> Деталі зі складною геометрією
          можуть потребувати додаткової ручної роботи для обробки або навіть
          створення роздільних форм, що збільшує витрати.
        </>,
        <>
          <strong>Обробка готових виробів.</strong> Якщо потрібна додаткова
          обробка (шліфування, фарбування, полірування), це додає до загальної
          вартості. Спеціальні покриття або тести на якість також впливають на
          кінцеву ціну.
        </>,
        <>
          <strong>Час виконання замовлення.</strong> Термінове замовлення може
          коштувати дорожче через необхідність пришвидшити процеси.
        </>,
        <em>
          {' '}
          Для більш точного розрахунку вам необхідно, разом із заявкою на пошту
          відправити фотографії, ескізи або креслення виробу. Швидше і точніше
          за все ми зможемо зробити розрахунок по 3D-моделі.
        </em>,
      ],
    },
    {
      question: 'Що таке прототип і для чого він потрібен?',
      text: [
        'Дослідний зразок (прототип, майстер-модель) – це повноцінна модель виробу, що запускається в серію. Усі параметри подібного зразка відповідають натуральним величинам та характеристикам майбутнього продукту.',
        'Подібні зразки необхідні для проведення якісних випробувань – наприклад, на збирання або тестування функцій. Саме завдяки подібному прототипу ми можемо заздалегідь виявити та відкоригувати всі недоліки, перед тим як ніж запускати виріб у серію.',
        'Крім того, дослідний зразок знадобиться вам для створення гнучких форм у випадку виготовлення виробу вакуумним литтям.',
      ],
    },
    {
      question: 'Як ви обробляєте готові вироби після лиття?',
      text: [
        'За допомогою зрізання та фрезерування проводиться зачистка від технологічних елементів, літників та напливів. За потреби виріб фарбується.',
      ],
    },
    {
      question: 'Яку мінімальну кількість деталей можна замовити?',
      text: [
        'Ми спеціалізуємося на дрібносерійному литті, але можемо виготовити виріб і в одиничному екземплярі. Але чим менше буде партія, тим вище буде вартість одного виробу.',
      ],
    },
  ],
};

export const textFaq = {
  ua,
};
