import React from 'react';

export const textMassProduction = {
  forWrapper: {
    content: {
      main: {
        header: 'Дрібносерійне лиття пластмас у вакуумі',
        description: (
          <>
            Дрібносерійне лиття пластмас у вакуумі – це сучасна технологія, яка
            дозволяє створювати невелику кількість пластикових деталей{' '}
            <strong>(від 1 до 1000 штук)</strong> швидко, якісно та з
            мінімальними витратами.
          </>
        ),
      },
      img: {
        link: '/services/buttons.jpg',
        alt: "Кнопки комп'ютерної клавіатури, розсипані на столі",
      },
    },

    backgroundStyle: 2,
  },

  howItWorks: {
    header: 'Як це працює',
    paragraphs: [
      'Рідким багатокомпонентним поліуретаном заповнюють гнучкі форми (з силікону чи поліуретану), без застосування високого тиску, оскільки технологія лиття в вакуумі здатне забезпечити ідеальне заповнення форми. Виріб буде майже повністю відповідати моделям, виготовленим штампуванням під тиском з традиційних матеріалів.',
    ],
  },

  benefits: {
    header: 'Переваги',
    list: [
      <>
        <strong>Швидкість.</strong> Виготовлення форми та деталей займає
        набагато менше часу, ніж у традиційному виробництві.
      </>,
      <>
        <strong>Гнучкість.</strong> Можна використовувати різні види пластику з
        різними властивостями – від прозорих до ударостійких, з різними
        текстурами поверхонь, можливе армування заставними елементами (болти,
        різьбові втулки, гайки).
      </>,
      <>
        <strong>Деталізація.</strong> Ця технологія дозволяє відтворити навіть
        найдрібніші елементи.
      </>,
      <>
        <strong>Економія.</strong> Процес значно дешевший, ніж створення
        металевих форм для масового виробництва.
      </>,
    ],
  },

  useCases: {
    header: 'У яких випадках дрібносерійне лиття буде корисним?',
    list: [
      'Створення прототипів, наприклад, для тестування, доопрацювання або презентації ○ нових продуктів перед запуском у масове виробництво.',
      'Невеликі серії товарів для продажу.',
      'Запчастини та аксесуари, особливо коли виробництво оригінальних деталей уже припинено.',
      'У разі непередбачених обставин, пов’язаних з терміном поставок необхідних деталей (затримки у виробництві, проблеми перетину кордонів, занадто віддалена локація виробника).',
    ],
  },

  stages: {
    header: 'Етапи виробництва:',
    // eslint-disable-next-line @typescript-eslint/prefer-as-const
    nestedListIcon: 'cup' as 'cup',
    nestedList: [
      {
        header: '1. Початковий етап – створення майстер-моделі',
        paragraphs: [
          "Спочатку виготовляється 'майстер-модель' – це еталонний зразок деталі, який може бути створеним вручну або за допомогою 3D-друку. Ця модель визначає форму та деталі майбутніх виробів.",
        ],
      },
      {
        header: '2. Силіконова форма',
        paragraphs: [
          'Майстер-модель поміщають у спеціальну рамку, після чого заливають рідким силіконом. Коли силікон твердне, його розрізають і виймають майстер-модель – так утворюється точна копія форми.',
        ],
      },
      {
        header: '3. Заливка пластику у вакуумі',
        paragraphs: [
          'У готову силіконову форму заливають рідкий пластик. Вакуумація видаляє повітря, щоб пластик рівномірно заповнив всі дрібні деталі форми. Це дозволяє отримати точні, якісні копії без бульбашок чи дефектів.',
        ],
      },
      {
        header: '4. Затвердіння та фінальні роботи',
        paragraphs: [
          'Пластик затвердіває всередині форми (час залежить від матеріалу). Після цього форму розбирають, і деталь готова. Її можна обробити, пофарбувати чи відшліфувати для досягнення потрібного вигляду.',
        ],
      },
    ],
  },

  importantMoments: {
    header: 'На що звернути увагу?',
    list: [
      <>
        <strong>Матеріал деталей.</strong> Вибір пластику залежить від того, як
        і де ви будете використовувати виріб. Наприклад, для функціональних
        елементів важливо врахувати міцність і стійкість до температур.
      </>,
      <>
        <strong>Обмеження форм.</strong> Силіконові форми мають певний термін
        служби – чим більше копій, тим швидше форма зношується.
      </>,
      <>
        <strong>Розмір виробів.</strong> Технологія підходить для деталей
        середнього та малого розміру, але не для дуже великих об’єктів.
      </>,
    ],
  },

  whyNot3Dprinting: {
    header: 'Чому 3D-друку недостатньо?',
    paragraphs: [
      'На жаль, у наш час створення виробів за допомогою 3D принтера недостатньо, щоб задовольнити технологічні запити сучасної промисловості. Ці обмеження роблять 3D-друк менш ефективним для серійного виробництва в порівнянні з литтям у вакуумі.',
      <strong>З ключових недоліків 3D-друку виділяють:</strong>,
    ],
    list: [
      'Вузький асортимент матеріалів та палітри. Не всі матеріали для 3D-друку мають властивості, які потрібні для складних або функціональних виробів (наприклад, міцність, термостійкість).',
      'Спрощену деталізацію (підвищення якості поверхні різко підвищує вартість друку).',
      "Друк кожної деталі займає багато часу, особливо для великих або складних об'єктів.",
      'Для великої кількості деталей 3D-друк дорожчий, ніж лиття.',
    ],
  },
};
