export const textModeling3D = {
  forWrapper: {
    content: {
      main: {
        header: 'Промисловий 3D-дизайн',
        description:
          "Створення 3D-моделі (або 3D-дизайн) - це процес розробки за допомогою комп'ютерної графіки комплексної цифрової тривимірної моделі майбутнього виробу. ",
      },
      img: {
        link: '/services/3D-modeling-process.jpeg',
        alt: "Монітор комп'ютера із зображенням 3D моделі дрона",
      },
    },

    backgroundStyle: 1,
  },

  useCases: {
    header: 'Де буде корисною 3D-модель?',
    list: [
      '- Друк прототипів на 3D-принтері',
      '- Візуалізація майбутнього виробу',
      '- Виготовлення деталей на фрезерних верстатах з ЧПУ',
      '- Виготовлення жорстких ливарних форм',
    ],
  },
  stages: {
    header: 'Етапи створення 3D-моделі',
    // eslint-disable-next-line @typescript-eslint/prefer-as-const
    nestedListIcon: 'laptop' as 'laptop',
    nestedList: [
      {
        header: 'Формування технічного завдання (ТЗ):',
        list: [
          '- Визначення мети створення моделі (виробництво, візуалізація, симуляція)',
          '- Аналіз документації (креслення, ескізи, технічні характеристики)',
          '- Вибір матеріалів',
          '- Визначення необхідного рівня деталізації та масштабування',
        ],
      },
      {
        header: 'Розробка концепції та попередня візуалізація',
        list: [
          '- Створення ручних або цифрових ескізів',
          '- Створення початкової концептуальної моделі з використанням базових форм',
          '- Узгодження концепції з замовником',
        ],
      },
      {
        header: '3D-моделювання',
        list: [
          '- Розробка базової геометрії моделі',
          '- Додавання дрібних елементів (отвори, ребра, канавки)',
          '- Створення текстур для візуалізації',
        ],
      },
      {
        header: 'Фінальна валідація',
        list: [
          '- Погодження кінцевої моделі з замовником',
          '- Надання всіх необхідних файлів і документації',
          '- Планування подальшого виробництва',
        ],
      },
      {
        header: 'Адаптація моделі до обраного способу виробництва',
        list: [
          '- Поділ моделі на сегменти для виробничих потреб, створення креслень, схем складання, специфікацій',
          '- Експорт файлів у необхідному форматі для 3D-друку або ЧПК-обробки',
        ],
      },
    ],
  },
  product: {
    header: 'Що ви отримуєте?',
    list: [
      '- Готову 3D-модель в STL форматі',
      '- Можливість виготовлення прототипу виробу, на базі створеної цифрової моделі',
    ],
  },
};
