import React from 'react';

export const textPrinting3D = {
  forWrapper: {
    content: {
      main: {
        header: '3D-друк',
        description:
          '3D-друк - це технологія створення фізичних об’єктів шляхом пошарового додавання матеріалу відповідно до цифрової моделі. Цей метод дозволяє швидко виготовляти прототипи, складні конструкції та навіть кінцеві продукти з різних матеріалів. ',
      },
      img: {
        link: '/services/3D-printer-products.jpeg',
        alt: '3D-принтер на столі та вироблені ним вироби',
      },
    },

    backgroundStyle: 3,
  },

  // howItWorks: {
  //   header: '',
  //   paragraphs: [
  //   ],
  //   list:
  // },
  howItWorks: {
    header: 'Як працює 3D-принтер?',
    list: [
      'Процес починається зі створення 3D-моделі за допомогою програмного забезпечення для 3D-дизайну (наприклад, CAD-програм).',
      'Модель віртуально розбивається на шари.',
      ' Принтер виконує друк, додаючи шар за шаром матеріал. Кожен шар з’єднується з попереднім, поки не формується готовий предмет.',
    ],
  },

  useCases: {
    header: 'У яких випадках 3D-друк буде корисним?',
    list: [
      <>
        <strong>Створення прототипів.</strong> Якщо потрібно швидко отримати
        прототип нового продукту або деталі, 3D-друк — це ідеальний варіант. Він
        дозволяє протестувати ідеї, не витрачаючи великі суми на традиційні
        методи виробництва.
      </>,
      <>
        <strong> Створення майстер-моделі.</strong> Прототип можна доопрацювати
        до рівня майстер-моделі, за допомогою якої виготовляється силіконова
        форма для серійного лиття пластика у вакуумі.
      </>,
      <>
        <strong> Індивідуальні предмети.</strong> Якщо вам потрібно зробити
        унікальний предмет, наприклад, подарунок чи запчастину, яка більше ніде
        не продається, 3D-друк може стати вигідним рішенням.
      </>,
      <>
        <strong>Складні конструкції.</strong> Створення об’єктів зі складною
        геометрією, які неможливо або дорого зробити традиційними методами.
      </>,
    ],
  },

  mainOptions: {
    header: 'Основні технології 3D-друку',
    paragraphs: [
      <>
        Існують різні види 3D-друку. Наша компанія використовує два найбільш
        поширених: <strong>FDM</strong> та <strong>SLA</strong>.
      </>,

      '3D-друк FDM і SLA не взаємозаперечні — часто їх використовують разом для різних етапів одного проєкту.',
    ],
  },

  fdm: {
    header: 'FDM',
    paragraphs: [
      <>
        <strong>Fused Deposition Modeling,</strong> або моделювання методом
        пошарового наплавлення - ця технологія використовує нитку термопластика,
        яка плавиться і наноситься шар за шаром.
      </>,
    ],
    // eslint-disable-next-line @typescript-eslint/prefer-as-const
    nestedListIcon: 'rocket' as 'rocket',
    nestedList: [
      {
        header: 'Переваги',
        list: [
          '- Матеріали порівняно дешеві, їх асортимент досить великий.',
          '- Варіативність постобробки.',
          '- Підходить для створення функціональних прототипів і деталей.',
          '- Друковані вироби можуть бути міцними й зносостійкими.',
        ],
      },
      {
        header: 'Недоліки',
        list: [
          '- Менша деталізація в порівнянні з іншими методами.',
          '- Помітні шари друку на поверхні моделі.',
        ],
      },
      {
        header: 'Що друкувати?',
        paragraphs: [
          'Досить великі вироби, які необхідно отримати швидко, без жорстких вимог до якості отриманого прототипу.',
          // <strong>Наприклад:</strong>,
          'Наприклад:',
          'Створення прототипу корпусу електронного пристрою для перевірки розмірів і функціональності; виробництво кріплень, інструментів, деталей для обладнання чи меблів тощо.',
        ],
      },

      {
        header: 'Важливо:',
        paragraphs: [
          'Побудова виробу за цією технологією залежить від товщини друкованого шару. Вона може змінюватись від 0,1 мм до 0,3 мм.',
          'Поверхня готового виробу найчастіше має низьку ребристість, що обумовлено круглою формою розплавленої нитки. Подібний недолік легко виправити на етапі постобробки.',
        ],
      },
    ],
  },

  sla: {
    header: 'SLA',
    paragraphs: [
      <>
        <strong>Stereolithography,</strong> або лазерна стереолітографія - ця
        технологія використовує рідку фотополімерну смолу, яка твердне під
        впливом лазера або джерела ультрафіолетового світла. Податливість
        фотополімеру у звичайному стані та затвердінні його під ультрафіолетовим
        світлом дозволяють досягти дуже широкого спектра характеристик
        майбутнього виробу.
      </>,
    ],
    // eslint-disable-next-line @typescript-eslint/prefer-as-const
    nestedListIcon: 'ball' as 'ball',
    nestedList: [
      {
        header: 'Переваги',
        list: [
          '- Висока деталізація та гладкість поверхонь.',
          '- Підходить для складних і дрібних моделей, наприклад, у ювелірній справі або стоматології.',
          '- Дозволяє друкувати вироби з прозорих чи спеціальних фотополімерів.',
          '- Варіативність властивостей дозволяють використовувати вирощений зразок як  повноцінний виріб.',
        ],
      },
      {
        header: 'Недоліки',
        list: ['- Дорожчі матеріали', '- Триваліше виробництво.'],
      },
      {
        header: 'Що друкувати?',
        paragraphs: [
          'SLA дозволяє створювати моделі з високою точністю та гладкою поверхнею, що робить цю технологію ідеальною для естетично значущих деталей.',
          'Наприклад:',
          'Виготовлення ювелірних виробів, архітектурних макетів, точних анатомічних моделей, ортодонтичних апаратів або коронок для зубів, частин годинників, мініатюрних моделей тощо.',
        ],
      },
    ],
  },

  important: {
    header: 'Майте на увазі',
    paragraphs: [
      'Попри чималі переваги 3D друку, для виготовлення невеликої партії деталей, значно дешевше й швидше отримати результат можна використовуючи вакуумне лиття в силіконові форми. ',
    ],
  },

  linkToMassProduction: {
    link: '/services/mass-production',
    text: 'Дрібносерійне лиття пластмас у вакуумі',
  },

  table: {
    headers: ['Характеристика', 'FDM', 'SLA'],
    rows: [
      ['Точність', 'Середня', 'Висока'],
      ['Швидкість', 'Вища для великих об’єктів', 'Повільніший процес'],
      ['Вартість', 'Дешевше', 'Дорожче'],
      ['Матеріали', 'Термопластики', 'Фотополімерні смоли'],
      ['Призначення', 'Функціональні прототипи', 'Високоточні деталі'],
    ],
    title: 'Порівняння FDM та SLA',
  },
};
