const ua = {
  mainHeader: 'Пишіть, дзвоніть та замовляйте!',
  mainHeaderCaption: 'Ми проконсультуємо та допоможемо з підбором матеріалів.',
  description: [
    'Оформлення замовлення може проводитись як від приватної особи, так і від організації.',
    'Є різні форми доставки та оплати замовлень.',
  ],
  speechBubble: {
    caption: 'Ваші ідеї буде втілено!',
    alt: 'спіч бабл',
  },
  illustrationAlt: 'Двоє людей обговорюють бізнес угоду',
};

export const textConstactsSectionHomePage = {
  ua,
};
