const ua = {
  statements: [
    {
      question: 'Ви маєте ідею, але не знаєте, з чого почати?',
      answer:
        'Ми допоможемо із розробкою з нуля або виготовимо виріб за ескізом.',

      img: 'marketing/sketch.png',
      alt: 'зарис пластикової деталі',
    },
    {
      question: 'Вам треба дрібносерійна партія деталей *ще на вчора*? ',
      answer:
        'Виробимо у кількості 1-1000 штук, що дозволить вам зекономити бюджет та вкластися у термін кількох днів.',
      img: 'marketing/multiple-details.png',
      alt: 'кілька однакових чохлів для телефона',
    },
    {
      question: 'Маєте зношену або поламану деталь?',
      answer: 'Ми зробимо її точну копію. Або навіть краще.',

      img: 'marketing/detail-replacement.png',
      alt: 'зламана деталь поряд із ідентичною цілою деталлю',
    },
    {
      question: 'Вашій колекції не вистачає фігурки леприкона?',

      answer:
        'У нас ви знайдете   широкий вибір матеріалів та кольорів для лиття або 3D-друку з високою деталізацією.',

      img: 'marketing/leprechaun.png',
      alt: 'пластиова фігурка леприкона',
    },
    {
      question: 'Власноруч робите мило або шоколадки?',
      answer:
        'Виготовимо  унікальні силіконові форми, яких не буде ні у кого, крім вас.',
      img: 'marketing/soap-silicone-mold.png',
      alt: 'силіконова форма для мила у формі Маріо',
    },
  ],
};

export const textSectionMarketing = {
  ua,
};
