const ua = {
  header: 'Виготовлення виробів із пластмас будь-якої складності',
  ourBenefitsList: [
    {
      text: 'Пропонуємо якісні послуги лиття із пластмас під низьким тиском.',
      icon: '/icons/drop-icon.png',
    },
    {
      text: 'Забезпечуємо повний цикл: від вашої креативної ідеї до її повного втілення та виробництва.',
      icon: '/icons/arrows-icon.png',
    },
    {
      text: 'Маємо ґрунтовний досвід та широку спеціалізацію, від дослідних моделей тонкого профілю до комплексних розробок нових виробів.',
      icon: '/icons/medal-icon.png',
    },
    {
      text: 'Використовуємо індивідуальний підхід до кожного замовника, врахуємо всі ваші інтереси.',
      icon: '/icons/angled-ball-icon.png',
    },
  ],
};

export const textDescriptionSection = {
  ua,
};
